wisteria-1c/Конфигурация/Documents/ВыплатыСамозанятым.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>ВыплатыСамозанятым</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccountingRegister.Управленческий</xr:Item>
				<xr:Item>AccumulationRegister.РасчетыСПрочимиКонтрагентами</xr:Item>
				<xr:Item>AccumulationRegister.ДоходыИРасходы</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РучнаяКорректировка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетаУчетаЗатратВТаблице</Name>
					<Comment>АПК:58 Документ перенесен из БП</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтруктурнаяЕдиница</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УслугаВТаблице</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Номенклатура</Name>
					<Comment>АПК:58 Документ перенесен из БП</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетОрганизации</Name>
					<Comment>АПК:58 Документ перенесен из БП</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Корреспонденция</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Управленческий</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаправлениеДеятельности</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НаправленияДеятельности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Проект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХозяйственнаяОперация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХозяйственныеОперации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Выплаты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Контрагент</Name>
							<Comment>АПК:58 Документ перенесен из БП</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Договор</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>БанковскийСчет</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Comment>АПК:58 Документ перенесен из БП</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Содержание</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СсылкаНаЧек</Name>
							<Comment>Ссылка на чек на сайте ФНС</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерЧека</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЧекСамозанятого</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВыплатыСамозанятымПрисоединенныеФайлы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПричинаОтказа</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ПричиныОтказаВЧекахВыплатСамозанятым</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РасшифровкаРезультата</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>1000</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗаказПокупателя</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

wisteria-1c/Конфигурация/Documents/ВыплатыСамозанятым/Forms/ФормаЧекаСамозанятого/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Не ПравоДоступа("Изменение", Метаданные.Документы.ВыплатыСамозанятым) Тогда
		ТолькоПросмотр = Истина;
		Элементы.КомандыИзображения.Видимость = Ложь;
	КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, Параметры, "НомерЧека, СсылкаНаЧек, ЧекСамозанятого, РеестрВыплатСамозанятым");
	
	ПредыдущееЗначениеСсылкиНаЧек = СсылкаНаЧек;
	
	ВывестиКартинку(АдресКартинки, ЧекСамозанятого);
	
	УправлениеФормой(ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура СсылкаНаЧекПриИзменении(Элемент)
	
	Если СсылкаНаЧек = ПредыдущееЗначениеСсылкиНаЧек Тогда
		Возврат;
	КонецЕсли;
	
	ПредыдущееЗначениеСсылкиНаЧек = СсылкаНаЧек;
	
	Если СтрНайти(СсылкаНаЧек, ВыплатыСамозанятымВызовСервераПовтИсп.АдресСервисаФНС()) = 0 Тогда
		// Это не ссылка на чек, поэтому ничего не делаем
		Возврат;
	КонецЕсли;
	
	ПолучитьДанныеПоСсылкеНаЧек();
	
	УправлениеФормой(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура АдресКартинкиНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Если РеестрВыплатСамозанятым.Пустая() Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(
			НСтр("ru='Для загрузки чека запишите документ ""Выплаты самозанятым""'"));
		Возврат;
	КонецЕсли;
	Если Не ЗначениеЗаполнено(АдресКартинки) Тогда
		ОписаниеОповещения = Новый ОписаниеОповещения("ДобавлениеЧекаСамозанятогоЗавершение", ЭтотОбъект);
		РаботаСФайламиКлиент.ДобавитьФайл(ОписаниеОповещения, РеестрВыплатСамозанятым, ЭтотОбъект, 2);
	Иначе
		ДанныеФайла = ДанныеФайла(ЧекСамозанятого, УникальныйИдентификатор);
		РаботаСФайламиКлиент.ОткрытьФайл(ДанныеФайла);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПерейтиПоСсылке(Команда)
	Если ЗначениеЗаполнено(СсылкаНаЧек) Тогда
		ПерейтиПоНавигационнойСсылке(СсылкаНаЧек);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура КомандаОК(Команда)
	
	Структура = Новый Структура;
	Структура.Вставить("СсылкаНаЧек", СсылкаНаЧек);
	Структура.Вставить("НомерЧека", НомерЧека);
	Если Не ЗначениеЗаполнено(АдресКартинки) Тогда
		Структура.Вставить("ЧекСамозанятого", ПредопределенноеЗначение("Справочник.ВыплатыСамозанятымПрисоединенныеФайлы.ПустаяСсылка"));
	Иначе
		Структура.Вставить("ЧекСамозанятого", ЧекСамозанятого);
	КонецЕсли;
		
	Закрыть(Структура);
	
КонецПроцедуры

&НаКлиенте
Процедура КомандыИзображения(Команда)
	
	ОписаниеОповещения = Новый ОписаниеОповещения("КомандыИзображенияПродолжение", ЭтотОбъект);
	
	СписокДоступныхКоманд = Новый СписокЗначений;
	Если ЗначениеЗаполнено(АдресКартинки) Тогда
		СписокДоступныхКоманд.Добавить("ПросмотретьИзображение",
			НСтр("ru='Просмотреть'"),,БиблиотекаКартинок.ПолеВводаОткрыть);
	Иначе
		СписокДоступныхКоманд.Добавить("ДобавитьИзображение",
			НСтр("ru='Добавить'"),,БиблиотекаКартинок.СоздатьЭлементСписка);
	КонецЕсли;
	
	ПоказатьВыборИзМеню(ОписаниеОповещения, СписокДоступныхКоманд, ТекущийЭлемент);
	
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьЧек(Команда)
	
	СсылкаНаЧек = "";
	НомерЧека = "";
	АдресКартинки = "";
	ПредыдущееЗначениеСсылкиНаЧек = "";
	УправлениеФормой(ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ДобавлениеЧекаСамозанятогоЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ЧекСамозанятого = Результат.ФайлСсылка;
	ВывестиКартинку(АдресКартинки, ЧекСамозанятого);
	УправлениеФормой(ЭтотОбъект);
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ВывестиКартинку(АдресКартинки, Знач ЧекСамозанятого)
	
	Если ЗначениеЗаполнено(ЧекСамозанятого) Тогда
		АдресКартинки = РаботаСФайлами.ДанныеФайла(ЧекСамозанятого).СсылкаНаДвоичныеДанныеФайла;
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ДанныеФайла(ФайлКартинки, УникальныйИдентификатор)
	
	ДополнительныеПараметры = РаботаСФайламиКлиентСервер.ПараметрыДанныхФайла();
	ДополнительныеПараметры.ИдентификаторФормы = УникальныйИдентификатор;
	
	Возврат РаботаСФайлами.ДанныеФайла(ФайлКартинки, ДополнительныеПараметры);
	
КонецФункции

&НаСервере
Процедура ПолучитьДанныеПоСсылкеНаЧек()
	
	НомерЧека = ВыплатыСамозанятым.НомерЧекаИзСсылки(СсылкаНаЧек);
	ЧекСамозанятого = ВыплатыСамозанятым.ЧекСамозанятогоИзИнтернета(СсылкаНаЧек, ЧекСамозанятого, РеестрВыплатСамозанятым);
	
	Если ЗначениеЗаполнено(ЧекСамозанятого) Тогда
		ВывестиКартинку(АдресКартинки, ЧекСамозанятого);
	Иначе
		ТекстСообщения = НСтр("ru='Не удалось скачать чек с сайта ФНС. 
			|Проверьте ссылку или попробуйте загрузить чек позднее'");
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, , "СсылкаНаЧек");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УправлениеФормой(Форма)
	
	Элементы = Форма.Элементы;
	Элементы.ФормаОчиститьЧек.Видимость = ЗначениеЗаполнено(Форма.АдресКартинки);
	
КонецПроцедуры

#Область РаботаСИзображением

&НаКлиенте
Процедура ДобавитьИзображениеНаКлиенте()
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ДобавлениеЧекаСамозанятогоЗавершение", ЭтотОбъект);
	РаботаСФайламиКлиент.ДобавитьФайл(ОписаниеОповещения, РеестрВыплатСамозанятым, ЭтотОбъект, 2);
	
КонецПроцедуры

&НаКлиенте
Процедура КомандыИзображенияПродолжение(ВыбранныйЭлемент, ПараметрыФайла) Экспорт
	
	Если ВыбранныйЭлемент = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ВыбранныйЭлемент.Значение = "ПросмотретьИзображение" Тогда
		ПросмотретьИзображение();
	ИначеЕсли ВыбранныйЭлемент.Значение = "ДобавитьИзображение" Тогда
		ДобавитьИзображениеНаКлиенте();
	Иначе
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПросмотретьИзображение()
	
	ДанныеФайла = ДанныеФайла(ЧекСамозанятого, УникальныйИдентификатор);
	РаботаСФайламиКлиент.ОткрытьФайл(ДанныеФайла);
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти
